rails-address-book/app/models/contact.rb

  def self.to_csv
    CSV.generate(headers: true) do |csv|
      csv << column_names

      all.each do |contact|
---
SELECT "contacts".* FROM "contacts"