rails-address-book/app/controllers/contacts_controller.rb

  def show
    @contacts = Contact.all
---
SELECT "contacts".* FROM "contacts"

  def destroy
    @contact.destroy!
---
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 3]]