rails-recipes-ai/app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("name", "ingredients", "created_at", "updated_at", "content") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "aligot"], ["ingredients", "aligot, patates"], ["created_at", "2024-11-25 08:52:53.822852"], ["updated_at", "2024-11-25 08:52:53.822852"], ["content", nil]]

  def update
    if @recipe.update(recipe_params)
---
UPDATE "recipes" SET "name" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["name", "Guacamole au piment"], ["updated_at", "2024-11-25 09:14:04.655677"], ["id", 1]]

  def destroy
    @recipe.destroy!
---
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 3]]